{
  "en": {
    "title": "About me",
    "content": "I'm a Frontend Developer with over four years of experience, specializing in ReactJS. I love diving into the latest tech, whether it's styled-components, TypeScript, or playing around with Node.js and Next.js on the side.<br/><br/>Outside of work, you'll find me tinkering with code, experimenting with new ideas, and occasionally dabbling in Python. I'm a quick learner who's always up for a challenge!<br/><br/>Being a remote worker for more than three years, I've mastered the art of self-organization and thrive in collaborative team settings. I'm all about delivering top-notch results while keeping things fun and engaging.<br/><br/>"
  },
  "es": {
    "title": "Sobre mí",
    "content": "Soy un desarrollador frontend con más de cuatro años de experiencia, especializado en ReactJS. Me encanta sumergirme en la última tecnología, ya sea styled-components, TypeScript, o jugando con Node.js y Next.js en mi tiempo libre.<br/><br/>Fuera del trabajo, me encontrarás experimentando con código, probando nuevas ideas y ocasionalmente incursionando en Python. ¡Soy un aprendiz rápido que siempre está listo para un desafío!<br/><br/>Siendo un trabajador remoto durante más de tres años, he dominado el arte de la autoorganización y prospero en entornos colaborativos. ¡Mi objetivo es entregar resultados de primera calidad manteniendo las cosas divertidas y atractivas!<br/><br/>"
  },
  "pt": {
    "title": "Sobre mim",
    "content": "Sou um desenvolvedor frontend com mais de quatro anos de experiência, especializado em ReactJS. Adoro me aprofundar na última tecnologia, seja styled-components, TypeScript, ou brincando com Node.js e Next.js no meu tempo livre.<br/><br/>Fora do trabalho, você me encontrará mexendo com código, experimentando novas ideias e ocasionalmente mexendo com Python. Sou um aprendiz rápido que está sempre pronto para um desafio!<br/><br/>Sendo um trabalhador remoto por mais de três anos, dominei a arte da auto-organização e prospero em ambientes colaborativos. Meu objetivo é entregar resultados de alta qualidade mantendo as coisas divertidas e envolventes!<br/><br/>"
  }
}
