{
  "en": {
    "title": "My \"persona\"",
    "content": "Outside of my work life, you will find me dedicated to a wide variety of activities. I consider myself a serene person, deeply connected with nature, always seeking outdoor activities and new experiences whenever possible. My passion lies in the creative process of things, whether crafting something by hand or programming whatever comes to mind. In the tangible realm, I have a do-it-yourself spirit and enjoy seeing my ideas materialize into things.<br/><br/>On the other hand, I appreciate the artistic and spiritual dimensions of life. I play my guitar to disconnect from the world, draw to see things from another perspective, while cooking is a blank canvas where three or more ingredients become a work of art. In my daily life, I practice Yoga to help with concentration, I rock climb which teaches me to push my limits, while hiking helps me reconnect with nature.<br/><br/>My mind is a world of endless curiosity, a relentless pursuit of knowledge, and an insatiable thirst for life's mysteries. Topics like astrology, meditation, and mindfulness not only nourish my intellect but also foster a deep connection with the ethereal, bringing tranquility to my being.<br/><br/>"
  },
  "es": {
    "title": "Mi \"persona\"",
    "content": "Fuera de mi vida laboral, me encontrarás dedicado a una gran variedad de actividades. Me considero una persona serena, profundamente conectada con la naturaleza, siempre que posible haciendo actividades al aire libre y buscando nuevas experiencias. Mi pasión radica en el proceso creativo de las cosas, ya sea elaborando algo a mano o programando lo que pase por mi cabeza. En el ámbito tangible tengo un espíritu de hazlo-tú-mismo y disfruto con ver mis ideas, materializarse en cosas.<br/><br/>Por otro lado, aprecio las dimensiones artísticas y espirituales de la vida. Toco mi guitarra para desconectarme del mundo, dibujo para ver las cosas desde un otro punto de vista, mientras que cocinar es un lienzo en blanco donde hago que tres o más ingredientes se conviertan en una obra de arte. En mi día a día, práctico Yoga para ayudarme con la concentración, hago escalada y esto me enseña a superar mis límites, mientras que el senderismo me ayuda a reconectar con la naturaleza.<br/><br/>Mi mente es un mundo de curiosidad inacabable, una búsqueda implacable de conocimiento y una sed insaciable de los misterios que la vida presenta. Temas como la astrología, la meditación y la atención plena no solo nutre mi intelecto, sino que también fomenta una profunda conexión con lo etéreo, trayendo tranquilidad a mi ser.<br/><br/>"
  },
  "pt": {
    "title": "Minha \"pessoa\"",
    "content": "Fora da minha vida profissional, muitas vezes você me encontrará envolvido em um mar de atividades diversas. Considero-me uma pessoa tranquila, profundamente conectada à natureza, sempre me envolvendo em atividades ao ar livre e buscando novas experiências. Minha paixão reside no processo criativo das coisas, seja elaborando algum objeto à mão ou programando linhas de código. No âmbito tangível, personifico um espírito de faça-você-mesmo e me sinto realizado ao ver minhas ideias se transformarem em coisas.<br/><br/>Por outra parte, tenho uma profunda apreciação pelas dimensões artísticas e espirituais da vida. Toco o meu violão para desconectar do mundo, desenho para poder ver as coisas desde outro ponto de vista, e cozinhar é como ter uma tela em branco, onde três ou mais ingredientes torna-se uma obra de arte. No meu dia a dia, pratico Yoga que me ajuda com a concentração, faço escalada para aprender a superar os meus limites e sempre quando possível, faço caminhada para voltar a conectar com a natureza.<br/><br/>Minha mente é um mundo de curiosidade inacabável, sempre buscando aprender coisas novas e com uma sede insaciável pelos mistérios que a vida apresenta. Coisas como a astrologia, meditação e atenção plena são como um ímã para meu ser, promovem uma profunda conexão com o etéreo e também trazem paz espiritual.<br/><br/>"
  }
}
